

const data = 
[{
  
    "id":"8",
    "hex_color":"FFCD1C",
    "name":"ОСНОВА",
    "stations":[
    {
        "name": "9816 - Нач. отд. админ. ЦОИ"
    },
    {
        "name": "9528 - Инженер-электроник ЦОИ"
    },
    {
        "name": "9688 - Инженер-электроник ЦОИ"
    },
    {
        "name": "9717 - Комната печати ЦОИ"
    },
    {
        "name": "9248 - Техник отд. ПО ЦОИ"
    },
    {
        "name": "9032 - Техник отд. ТСО ЦОИ"
    },
    {
        "name": "9037 - Техник отд. УИС ЦОИ"
    },
    {
        "name": "9360 - Факс нач. ЦОИ"
    },
    {
        "name": "9028 - ЦОД ОС ЦОИ"
    },
    {
        "name": "9062 - ЦСО ЦОИ"
    },
    {
        "name": "9628 - Электронная почта ЦОИ"
    },
    {
        "name": "9138 - ЦОД ОС ЦОИ (аквариум)"
    },
    {
        "name": "9948 - Инженеры ЦСО"
    },
    {
        "name": "9354 - Юридическая служба"
    },
    {
        "name": "9316 - Начальник автослужбы"
    },
    {
        "name": "9616 - Инженер автослужбы"
    },
    {
        "name": "9550 - Дежурный по абонементу библиотеки ВАС"
    },
    {
        "name": "9350 - Заведующая библиотекой ВАС"
    },
    {
        "name": "9850 - Зам. зав. библиотекой ВАС"
    },
    {
        "name": "9451 - Зав. абонементом библиотеки ВАС"
    },
    {
        "name": "9650 - Абонемент библиотеки ВАС"
    },
    {
        "name": "9150 - Библиотекарь библиотеки ВАС"
    },
    {
        "name": "9450 - Отдел обработки библиотеки ВАС"
    },
    {
        "name": "9750 - Фонд 1 этажа библиотеки ВАС"
    },
    {
        "name": "9250 - Фонд цок. этажа библиотеки ВАС"
    },
    {
        "name": "9351 - Читальный зал ДСП библиотеки ВАС"
    },
    {
        "name": "9323 - Зам. нач. ВАС по вооружению"
    },
    {
        "name": "9962 - Нач. отд. гр. контроля"
    },
    {
        "name": "9168 - Деж. по гр. контроля"
    },
    {
        "name": "9960 - Деж. по гр. контроля"
    },
    {
        "name": "9381 - Офицер напр. N1 гр. контроля"
    },
    {
        "name": "9383 - Офицер напр. N2 гр. контроля"
    },
    {
        "name": "5921 - Дежурный по мед. корпусу в/г 123 (ГП-12)"
    },
    {
        "name": "9318 - Начальник медслужбы"
    },
    {
        "name": "9386 - Начальник мобгруппы"
    },
    {
        "name": "9196 - Делопроизводство мобгруппы"
    },
    {
        "name": "9548 - Офицер мобгруппы"
    },
    {
        "name": "9486 - Офицер мобгруппы"
    },
    {
        "name": "9076 - Офицер мобгруппы"
    },
    {
        "name": "9017 - Дежурный по научной роте"
    },
    {
        "name": "9518 - Командир взвода научной роты"
    },
    {
        "name": "9406 - Кабинет ЗВКС начальника ВАС"
    },
    {
        "name": "9372 - Начальник отдела кадров"
    },
    {
        "name": "9069 - Зам. нач. отдела кадров"
    },
    {
        "name": "9572 - Пом. нач. отдела кадров"
    },
    {
        "name": "9272 - Инспектор отдела кадров"
    },
    {
        "name": "9472 - Инспектор отдела кадров"
    },
    {
        "name": "9490 - Инспектор по кадрам отдела кадров"
    },
    {
        "name": "9772 - Сотрудники отдела кадров"
    },
    {
        "name": "9872 - Специалист по кадрам отдела кадров"
    },
    {
        "name": "9274 - Факс отдела кадров"
    },
    {
        "name": "9823 - Факс паспортного стола (Науки 15)"
    },
    {
        "name": "9202 - Аппаратная управления полигона связи"
    },
    {
        "name": "9818 - Дежурная медсестра поликлиники"
    },
    {
        "name": "9419 - Хирургический кабинет поликлиники"
    },
    {
        "name": "9702 - Дежурный по столовой"
    },
    {
        "name": "9349 - Начальник продслужбы"
    },
    {
        "name": "9849 - Делопроизводство продслужбы"
    },
    {
        "name": "9285 - Председатель профкома"
    },
    {
        "name": "9385 - Председатель профкома"
    },
    {
        "name": "5831 - Дежурный по спецфакультету (ГП-3)"
    },
    {
        "name": "9380 - Начальник спецфакультета"
    },
    {
        "name": "9182 - Начальник УМК спецфакультета"
    },
    {
        "name": "9782 - Начальник курса спецфакультета"
    },
    {
        "name": "9480 - Зам. нач. спецфакультета, факс"
    },
    {
        "name": "9280 - Нач. курса спецфакультета"
    },
    {
        "name": "9580 - Нач. курса спецфакультета"
    },
    {
        "name": "9682 - Нач. лаб. спецфакультета"
    },
    {
        "name": "9582 - Нач. хоз. части спецфакультета"
    },
    {
        "name": "9880 - Деж. по гостинице спецфакультета"
    },
    {
        "name": "5841 - Деж. по общежитию спецфакультета (ГП-4)"
    },
    {
        "name": "9282 - Инженер лаборатории спецфакультета"
    },
    {
        "name": "9780 - Курсовой офицер спецфакультета"
    },
    {
        "name": "9286 - Секр. библиотека спецфакультета (к.211)"
    },
    {
        "name": "9180 - Учебная часть спецфакультета"
    },
    {
        "name": "9375 - Начальник строевого отдела"
    },
    {
        "name": "9475 - Зам. нач. строевого отдела"
    }
]
  
}];

const stations = [];

data.forEach(line => {stations.push(...line.stations);});
console.log(stations);

const searchInput = document.querySelector('.search');
const searchOptions = document.querySelector('.options');

function getOptions(word, stations) {
  return stations.filter(s => {
    // Определить совпадает ли то что мы вбили в input
    // названиям станций внутри массива

    const regex = new RegExp(word, 'gi');
    return s.name.match(regex);
  })
}

function displayOptions() {

  console.log('this.value >> ', this.value);

  const options = getOptions(this.value, stations);

  const html = options
    .map(station => {
      const regex = new RegExp(this.value, 'gi');
      const stationName = station.name.replace(regex, 
          `<span class="hl">${this.value}</span>`
        )

      return `<li><span>${stationName}</span></li>`;
    })
    .slice(0, 10)
    .join('');

  searchOptions.innerHTML = this.value ? html : null;
}



searchInput.addEventListener('change', displayOptions);
searchInput.addEventListener('keyup', displayOptions);
